staff('Авдеенко Татьяна Владимировна', 'Профессор', 'avdeenko@corp.nstu.ru').
staff('Аврунев Олег Евгеньевич', 'Старший преподаватель', 'avrunev@ciu.nstu.ru').
staff('Бекарева Нина Даниловна', 'Доцент', 'bekareva@fpm.ami.nstu.ru').
staff('Волкова Виктория Михайловна', 'Доцент', 'volkova@ami.nstu.ru').
staff('Гультяева Татьяна Александровна', 'Доцент', 't.gultyaeva@corp.nstu.ru').
staff('Еланцева Ирина Леонидовна', 'Доцент', 'elan@ami.nstu.ru').
staff('Зайцев Михаил Георгиевич', 'Доцент', 'zajcev@corp.nstu.ru').
staff('Карманов Виталий Сергеевич', 'Доцент', 'karmanov@corp.nstu.ru').
staff('Кобылянский Валерий Григорьевич', 'Доцент', 'kvg@ami.nstu.ru').
staff('Куликов Игорь Михайлович', 'Профессор', 'i.kulikov@corp.nstu.ru').
staff('Лемешко Борис Юрьевич', 'Профессор', 'Lemeshko@ami.nstu.ru').
staff('Лисицин Даниил Валерьевич', 'Профессор', 'lisitsin@ami.nstu.ru').
staff('Неделько Виктор Михайлович', 'Доцент', 'nedelko@corp.nstu.ru').
staff('Попов Александр Александрович', 'Профессор', 'a.popov@corp.nstu.ru').
staff('Постовалов Сергей Николаевич', 'Профессор', 'post@fpm.ami.nstu.ru').
staff('Самочернов Игорь Валентинович', 'Доцент', 'samochernov@corp.nstu.ru').
staff('Сивак Мария Алексеевна', 'Ассистент', 'pepelyaeva@ami.nstu.ru').
staff('Стасышин Владимир Михайлович', 'Доцент', 'stasyshin@ciu.nstu.ru').
staff('Стасышина Татьяна Леонидовна', 'Старший преподаватель', 'Stasyshina@ciu.nstu.ru').
staff('Тимофеев Владимир Семенович', 'Профессор', 'v.timofeev@corp.nstu.ru').
staff('Тимофеева Анастасия Юрьевна', 'Доцент', 'a.timofeeva@corp.nstu.ru').
staff('Фаддеенков Андрей Владимирович', 'Доцент', 'faddeenkov@corp.nstu.ru').
staff('Филиппова Елена Владимировна', 'Доцент', 'e.filippova@corp.nstu.ru').
staff('Хабаров Валерий Иванович', 'Профессор', 'v.xabarov@corp.nstu.ru').
staff('Хайленко Екатерина Алексеевна', 'Доцент', 'xajlenko@corp.nstu.ru').
staff('Целебровская Марина Юрьевна', 'Доцент', 'tselebrm@adm.nstu.ru').
staff('Цыгулин Алексей Александрович', 'Доцент', 'cygulin@corp.nstu.ru').
staff('Черникова Оксана Сергеевна', 'Доцент', 'chernikova@corp.nstu.ru').
staff('Чимитова Екатерина Владимировна', 'Профессор', 'chimitova@corp.nstu.ru').
staff('Чубич Владимир Михайлович', 'Профессор', 'chubich@ami.nstu.ru').

course('Автоматизированные системы обработки данных финансовых рынков', 1). 
course('Алгебра и геометрия', 1). 
course('Геоинформационные системы', 1). 
course('Дискретная математика', 1). 
course('Информационные технологии и основы программирования', 1). 
course('История и методология компьютерных наук', 1). 
course('Компьютерные технологии моделирования и анализа данных', 1). 
course('Математические методы оптимального планирования эксперимента', 1). 
course('Математический анализ', 1). 
course('Программная инженерия', 1). 
course('Программные системы компьютерного моделирования', 1). 
course('Программные системы статистического анализа', 1). 
course('Разработка мобильных приложений', 1). 
course('Сетевые информационные технологии', 1). 
course('Функциональное программирование', 1). 
course('Алгебра и геометрия', 2). 
course('Информатика', 2). 
course('Информационные технологии на современном предприятии', 2). 
course('Компьютерные технологии моделирования и анализа данных', 2). 
course('Математический анализ', 2). 
course('Методы активной идентификации динамических систем', 2). 
course('Модели временных рядов', 2). 
course('Моделирование стохастических динамических систем', 2). 
course('Объектно-ориентированные технологии разработки программного обеспечения', 2). 
course('Основы теории машинного обучения', 2). 
course('Распознавание образов', 2). 
course('Системное и прикладное программное обеспечение', 2). 
course('Современные технологии баз данных', 2). 
course('Агентно-ориентированные технологии', 3). 
course('Компьютерные технологии моделирования и анализа данных', 3). 
course('Математический анализ', 3). 
course('Метрология, качество и тестирование программного обеспечения', 3). 
course('Моделирование стохастических динамических систем', 3).
course('Объектно-ориентированное программирование', 3). 
course('Программные системы статистического анализа', 3). 
course('Программные средства защиты информации', 3). 
course('Проектирование систем реального времени', 3). 
course('Сетевые информационные технологии', 3). 
course('Теория вычислительных процессов и структур', 3). 
course('Количественные методы в менеджмента', 4). 
course('Комплексный анализ', 4). 
course('Компьютерные технологии анализа данных и обнаружения закономерностей', 4).
course('Компьютерный анализ гибридных систем', 4). 
course('Математический анализ', 4).
course('Операционные системы', 4). 
course('Операционные системы, среды и оболочки', 4). 
course('Основы построения экспертных систем и систем принятия решений в задачах управления', 4).
course('Принципы разработки программных комплексов для решения задач математической физики', 4).
course('Теория вероятностей', 4). 
course('Теория вероятностей и математическая статистика', 4). 
course('Функциональный анализ', 4). 
course('Численные методы', 4). 
course('Введение в искусственный интеллект и логическое программирование', 5). 
course('Вычислительная техника и программные средства в управлении социально-экономическими системами', 5). 
course('Интегрированные информационные среды', 5). 
course('Компьютерные сети', 5). 
course('Лингвистическое обеспечение информационных систем', 5). 
course('Логическое программирование', 5). 
course('Математическая статистика', 5). 
course('Математические и инструментальные средства разработки интеллектуальных систем', 5). 
course('Методы генерации сеток при решении краевых задач математической физики', 5).
course('Методы проектирования человеко-машинных систем', 5). 
course('Методы решения систем конечноэлементных уравнений', 5).
course('Модели и методы разработки программных систем для обработки данных и знаний', 5). 
course('Неконформные конечноэлементные методы в различных функциональных пространствах', 5). 
course('Низкоуровневое программирование', 5). 
course('Объектно-ориентированный анализ и программирование', 5). 
course('Операционные системы, среды и оболочки', 5). 
course('Основы web-программирования', 5). 
course('Основы интерактивного управления в системах', 5). 
course('Основы теории информации и криптографии', 5). 
course('Основы теории машинного обучения', 5). 
course('Системы поддержки принятия управленческих решений', 5). 
course('Статистические методы обработки сигналов и изображений в информационно-технических системах', 5). 
course('Теория активных систем', 5). 
course('Теория вероятностей и математическая статистика', 5). 
course('Человеко-машинное взаимодействие', 5). 
course('Численные методы', 5). 
course('Языки программирования и методы трансляции', 5). 
course('Компьютерная графика', 6). 
course('Методы оптимизации', 6). 
course('Разработка web-приложений и распределенных информационных систем', 6). 
course('Системный анализ', 6). 
course('Статистический анализ нечисловых данных', 6). 
course('Теория языков программирования и методы трансляции', 6). 
course('Технологии разработки программного обеспечения', 6). 
course('Управление ресурсами в вычислительных системах', 6). 
course('Базы данных и экспертные системы', 7). 
course('Компьютерное моделирование', 7). 
course('Математическое моделирование управляемых систем', 7). 
course('Методы принятия оптимальных решений', 7). 
course('Проектирование информационных систем', 7). 
course('Системы реального времени', 7). 
course('Статистические методы анализа данных', 7). 
course('Технологии баз данных', 7). 
course('Администрирование информационных систем', 8). 
course('Интеллектуальные системы', 8). 
course('Информационная безопасность', 8). 
course('Компьютерное моделирование', 8). 
course('Планирование и анализ эксперимента', 8). 

teacher('Авдеенко Татьяна Владимировна', Subject) :- 
    Subject='Введение в искусственный интеллект и логическое программирование' ;  
    Subject='Логическое программирование' ; 
    Subject='Основы теории информации и криптографии'.
teacher('Кобылянский Валерий Григорьевич', Subject) :-
    Subject='Операционные системы, среды и оболочки'.
teacher('Сивак Мария Алексеевна', Subject) :-
    Subject='Операционные системы, среды и оболочки'.
teacher('Чимитова Екатерина Владимировна', Subject) :-
    Subject='Теория вероятностей и математическая статистика' ;
    Subject='Методы оптимизации' ;
	  Subject='Методы принятия оптимальных решений'.
teacher('Рояк Михаил Эммануилович', Subject) :-
    Subject='Численные методы'.
teacher('Шурина Элла Петровна', Subject) :-
    Subject='Уравнения математической физики'.

class('Введение в искусственный интеллект и логическое программирование', Weekday, Time, Classroom) :- 
    Weekday=1 , Time='10:15' , Classroom='1-203а' ;
    Weekday=2 , Time='14:00' , Classroom='1-426'.
class('Операционные системы, среды и оболочки', Weekday, Time, Classroom) :- 
    Weekday=1 , Time='10:15' , Classroom='1-203а' ;
    Weekday=1 , Time='12:00' , Classroom='1-426'.
class('Теория вероятностей и математическая статистика', Weekday, Time, Classroom) :- 
    Weekday=1 , Time='12:00' , Classroom='1-426'.
class('Уравнения математической физики ', Weekday, Time, Classroom) :- 
    Weekday=5 , Time='14:00' , Classroom='2-424'.
    
schedule(Teacher, Classroom, Time, Weekday, Subject) :- teacher(Teacher, Subject) , class(Subject , Weekday, Time, Classroom).
interchangeable(X, Y) :- teacher(X, Subject) , teacher(Y, Subject), X \= Y.
isprofessor(X) :- staff(X, 'Профессор', _).
first_year(Subject) :- course(Subject, 1) ; course(Subject, 2).
second_year(Subject) :- course(Subject, 3) ; course(Subject, 4).
third_year(Subject) :- course(Subject, 5) ; course(Subject, 6).
fourth_year(Subject) :- course(Subject, 7) ; course(Subject, 8).
first_class(Subject) :- class(Subject, _, '8:30', _).
second_class(Subject) :- class(Subject, _, '10:15', _).
third_class(Subject) :- class(Subject, _, '12:00', _).
fourth_class(Subject) :- class(Subject, _, '14:00', _).
fifth_class(Subject) :- class(Subject, _, '15:45', _).
sixth_class(Subject) :- class(Subject, _, '17:30', _).
